import os 
from cheroot import wsgi
from cheroot.ssl.builtin import BuiltinSSLAdapter
from django.core.wsgi import get_wsgi_application
import environ

env = environ.Env()
os.environ.setdefault("DJANGO_SETTINGS_MODULE", "awcenter.settings")

application = get_wsgi_application()

HOST = env.str("IPV4_ADDRESS")
PORT = env.int("PORT")

server = wsgi.Server(
    bind_addr=(HOST, PORT),
    wsgi_app=application,
    numthreads=10,
    request_queue_size=200,
    timeout=120
)

CERT_FILE = "AWCenter.crt"
KEY_FILE = "AWCenter.key"

server.ssl_adapter = BuiltinSSLAdapter(CERT_FILE, KEY_FILE)

if __name__ == "__main__":
    try:
        print("")
        print("   █████████   █████   ███   █████      █████████                       █████                      ")
        print("  ███▒▒▒▒▒███ ▒▒███   ▒███  ▒▒███      ███▒▒▒▒▒███                     ▒▒███                       ")
        print(" ▒███    ▒███  ▒███   ▒███   ▒███     ███     ▒▒▒   ██████  ████████   ███████    ██████  ████████ ")
        print(" ▒███████████  ▒███   ▒███   ▒███    ▒███          ███▒▒███▒▒███▒▒███ ▒▒▒███▒    ███▒▒███▒▒███▒▒███")
        print(" ▒███▒▒▒▒▒███  ▒▒███  █████  ███     ▒███         ▒███████  ▒███ ▒███   ▒███    ▒███████  ▒███ ▒▒▒ ")
        print(" ▒███    ▒███   ▒▒▒█████▒█████▒      ▒▒███     ███▒███▒▒▒   ▒███ ▒███   ▒███ ███▒███▒▒▒   ▒███     ")
        print(" █████   █████    ▒▒███ ▒▒███         ▒▒█████████ ▒▒██████  ████ █████  ▒▒█████ ▒▒██████  █████    ")
        print("▒▒▒▒▒   ▒▒▒▒▒      ▒▒▒   ▒▒▒           ▒▒▒▒▒▒▒▒▒   ▒▒▒▒▒▒  ▒▒▒▒ ▒▒▒▒▒    ▒▒▒▒▒   ▒▒▒▒▒▒  ▒▒▒▒▒     ")
        print("")

        print(f"Started AW Center on https://{HOST}:{PORT}")
        server.start()
    except KeyboardInterrupt:
        server.stop()



